# بولین‌ها در پایتون
# false یا true :بولین‌ها این دوتا مقدار  رو می تونن داشته باشن
# تو برنامه نویسی اغلب احتیاج پیدا می کنید که
# هست false یا true  بفهمید یه عبارت
# وقتی دو تا عدد رو مقایسه می کنید، عبارت ارزیابی میشه
#  و پایتون یه جواب بولین برمی گردونه
# true ---> درست
# false ---> غلط

print(10 > 9)  # ---> True
print(10 == 9)  # ---> False
print(10 < 9)  # ---> False

# -----------------------------------------------------------
# false بر می گردونه یا true اجرا میکنید پایتون یا  if وقتی یه شرطی رو تو دستور
a = 200
b = 33

if b > a:  # ---> false
    print("b bozorgtar az a hast")  # این خط اجرا نمیشه
else:
    print("b bozorgtar az a nist")  # این خط اجرا میشه

# -----------------------------------------------------------
# به شما اجازه میده که هر مقداری رو ارزیابی کنید bool() فانکشن
# برمی گردونه false یا true و به شما
print(bool("Hello"))  # --> true
print(bool(15))  # --> true

x = "Hello"
y = 15

print(bool(x))  # --> true
print(bool(y))  # --> true

# -----------------------------------------------------------
# ارزیابی میشه اگر یه محتوایی داشته true تقریبا هر مقداری
# ارزیابی میشه true  هر رشته ای به غیر از رشته خالی
# ارزیابی میشه true  هر عددی به غیر از صفر
# ارزیابی میشه true به غیر از خالی هاشون list, tuple, set, dictionary هر
print(bool("abc"))  # ---> true
print(bool(123))  # ---> true
print(bool(["apple", "cherry", "banana"]))  # ---> true

# -----------------------------------------------------------
# هستن false بعضی مقادیر
# (), [], {}, "" مقادیر خالی مثل
# عدد 0
# false و خود
# ارزیابی میشن false
print(bool(""))  # ---> false
print(bool(()))  # ---> false
print(bool([]))  # ---> false
print(bool({}))  # ---> false
print(bool(False))  # ---> false
print(bool(None))  # ---> false
print(bool(0))  # ---> false


# -----------------------------------------------------------
# شما می تونید فانکشنی بسازید که بولین برگردونه
def myFunction():
    return True


print(myFunction())  # ---> true
# -----------------------------------------------------------
# می تونید
if myFunction():
    print("bale!")  # برمی گردونه true این چاپ میشه چون فانکشنمون اون بالا داره
else:
    print("na!")

# -----------------------------------------------------------
# پایتون خودش هم یسری فانکشن‌ها داره که بولین بر میگردونن
# که چک میکنه یه ابجکت از نوع خاصی هست یا نه isinstance() مثل
x = 38
print(isinstance(x, int))  # ---> true  هست (int) چون 38 عدد صحیح
