// متغیر های جاوااسکریپت فضایی هستند برای ذخیره مقادیر مختلف
// تو این مثال  
// x, y, 🇿
// تعریف شدن var متغیرهایی هستن که با کلمه کلیدی
var x = 5; 
//ذخیره میشه x مقدار 5 در فضایی توی حافظه به نام  

var y = 6;
//ذخیره میشه y مقدار 6 در فضایی توی حافظه به نام  

var z = x + y;
//ذخیره میشه z مقدار 11 در فضایی توی حافظه به نام  

//--------------------------------------------------------
// تنها راه تعریف متغیر بود var قبل از 2015 کلمه کلیدی 
//  این امکان اضافه شد که es6 ورژن 2015 جاوااسکریپت به نام
// برای تعریف متغیر هایی که به صورت ثابت هستند یعنی یک بار
// مقدار دهی میشوند و دیگر امکان مقداردهی ندارند از کلمه کلیدی
// استفاده کنید const
const x = "yasharhabibimedia"
x = "anotherpage" // خطا میده


// وهمچنین برای تعریف متغیر هایی که فقط تو یه اسکوپ یا به عبارتی
// استفاده کنید let ناحیه محدودی قابل دسترسی هستند از 

if(true){
    let y = "yasharhabibimedia"
    console.log(y) // ---> yasharhabibimedia
}
console.log(y) // ---> خطا میده ----> y is not defined

//--------------------------------------------------------

// تمام متغیرهای جاوااسکریپت باید با یه نام منحصر به فرد و یکتایی
// قابل شناسایی باشند این نام های یکتا شناسه نامیده میشوند
// x , y این شناسه ها میتونن نام های خیلی کوتاهی باشن مثل 
// age, sum, totalValue  یا توصیفی تر باشن مثل  

// --------------------------------------------------------
//var برای تعریف متغیر از کلمه کلیدی 
var pageName;
// = و برای مقدار دهی اون از عملگر 
pageName = "yasharhabibimedia";
// استفاده می کنیم
// تعریف و مقدار دهی متغیر رو می تونید همزمان انجام بدید
var pageName = "yasharhabibimedia";
// --------------------------------------------------------
//  تو برنامه ها متغیر ها اغلب بدون مقدار دهی اولیه تعریف میشوند
// این مقدار میتونه طی یه محاسباتی بدیت بیاد یا مثلا از طریق فیلدی
// توسط کاربر وارد بشه
//وقتی یه متغیری بدون مقدار دهی تعریف میشه
// در نظر گرفته میشه undefined  مقدارش 
var pageName; 
console.log(pageName) // ---> undefined
// --------------------------------------------------------

