# رشته ها در پایتون بین علامت نقل قول دوتایی یا نقل قول تکی قرار می گیرند
# (دابل کوتیشن)تقل قول دوتایی ---> ""
# (سینگل کوتیشن)نقل قول تکی ---> ''

# استفاده کنید print برای نمایش رشته ها می تونید از
print("yasharhabibimedia")

#----------------------------------------------------------

# میتونید یه رشته رو به یه متغیر نسبت بدید
a = "python"
print(a)

#-----------------------------------------------------------

# یه رشته تو پایتون مثل خیلی زبان های برنامه نویسی دیگه
# در اصل آرایه ای از کاراکترهاست

# آرایه ----> "salam" ---> s a l a m

# در نتیجه برای بدست آوردن یه کاراکتر خاص تو یه رشته می تونید
# با علامت براکت اینکار و انجام بدید

a = "yademoon bashe harchizi avalesh be nazar sakht miyad"
print(a[4]) # ---> m  

#-----------------------------------------------------------

#استفاده می کنیم len برای بدست آوردن طول رشته ها از 

a = "python"
print(len(a)) # ---> 6