# # رشته ها در پایتون بین علامت نقل قول دوتایی یا نقل قول تکی قرار می گیرند
# # (دابل کوتیشن)تقل قول دوتایی ---> ""
# # (سینگل کوتیشن)نقل قول تکی ---> ''
# print("------------------ bakhshe aval ----------------------")  
# # استفاده کنید print برای نمایش رشته ها می تونید از
# print("yasharhabibimedia")

# # ----------------------------------------------------------

# # میتونید یه رشته رو به یه متغیر نسبت بدید
# a = "python"
# print(a)

# # -----------------------------------------------------------

# # یه رشته تو پایتون مثل خیلی زبان های برنامه نویسی دیگه
# # در اصل آرایه ای از کاراکترهاست

# # آرایه ----> "salam" ---> s a l a m

# # در نتیجه برای بدست آوردن یه کاراکتر خاص تو یه رشته می تونید
# # با علامت براکت اینکار و انجام بدید

# a = "yademoon bashe harchizi avalesh be nazar sakht miyad"
# print(a[4])  # ---> m

# # -----------------------------------------------------------

# # استفاده می کنیم len برای بدست آوردن طول رشته ها از

# a = "python"
# print(len(a))  # ---> 6

# # -----------------------------------------------------------
# print("------------------ bakhshe dovom ---------------------")  

# برای اینکه یه بخشی از یه رشته رو برگردونیم
# یا به عبارتی یه قسمت از رشتمون رو ببریم
# از سینتکس اسلایس استفاده می کنیم


b = "Hello, World!"

# | 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 | 11 | 12 |
# | H | e | l | l | o | , |   | W | o | r |  l |  d |  ! |

print(b[2:5])  # ---> llo

# -----------------------------------------------------------

# پاک کردن فاصله ها از ابتدا و انتهای رشته

x = " yasharhabibimedia "
print(x.strip()) # ---> "yasharhabibimedia"

# -----------------------------------------------------------

z = "YasharHabibiMedia"
print(z.lower()) # ---> "yasharhabibimedia"

# -----------------------------------------------------------

c = "yasharhabibimedia"
print(c.upper()) # ---> "YASHARHABIBIMEDIA"