// عملگرهای جاوااسکریپت
// = عملگر انتساب
// یه مقداری رو به یه متغیر نسبت میده

var x = 10;

// عملگر بعلاوه +
// اعداد رو با هم جمع میکنه

var x = 5;
var y = 2;
var z = x + y; //---> 7

//عملگر ضرب *
// اعداد رو در هم ضرب میکنه

var x = 5;
var y = 2;
var z = x * y; //---> 10

// عملگرهای ریاضی در جاوااسکریپت
 
// توضیح         عملگرها 
//----------------------
//  +	        جمع
//  -	        تفریق
//  *	        ضرب
//  **	        توان (ES2016)
//  /	        تقسیم
//  %	        باقی مانده 
//  ++	        افزایش
//  --	        کاهش

// --------------------------------

// عملگرهای نسبت دهی در جاوااسکریپت

//   شبیه        مثال         عملگرها          
//------------------------------------
//      =	        x = y	    x = y
//      +=	        x += y	    x = x + y
//      -=	        x -= y	    x = x - y
//      *=	        x *= y	    x = x * y
//      /=	        x /= y	    x = x / y
//      %=	        x %= y	    x = x % y
//      **=	        x **= y	    x = x ** y

var x = 10;
x += 5;  // ----> 15

// عملگرهای رشته در جاوااسکریپت
// عملگر +
// برای اضافه کردن
// یا به عبارتی بهم وصل کردن دو رشته هم استفاده میشه

var txt1 = "Yashar";
var txt2 = "Habibi";
var txt3 = txt1 + " " + txt2;//---> Yashar Habibi

// عملگر +=
// برای اضافه یا وصل کردن دو رشته هم استفاده میشه

var txt1 = "yasharhabibimedia is a";
txt1 += " page for learning programming";  //yasharhabibimedia is a page for learning programming
// What a very nice day

// نکته: اضافه کردن اعداد خروجیش مجموع اعداده
// ولی خروجی جمع اعداد با رشته یه رشته خواهد بود

var x = 5 + 5; //---> 10
var y = "5" + 5; //---> 55
var z = "Hello" + 5; //---> Hello5

// عملگرهای مقایسه ای در جاوااسکریپت

// توضیح         عملگرها 
//-------------------------------------------------
//  ==	        مساوی با
//  ===	        مقدار و نوع داده ای برابر
//  !=	        مساوی نیست با
//  !==	        مقدار و نوع داده ای برابر نیست
//  >	        بزرگتر از
//  <	        کوچکتر از
//  >=	       بزرگتر مساوی
//  <=	       کوچکتر مساوی
//  ?	        عملگر سه گانه

// عملگرهای منطقی در جاوااسکریپت

// توضیح         عملگرها 
//------------------------------------
//   &&	            عملگر ( و ) منطقی
//   ||	                عملگر ( یا ) منطقی
//   !	                عملگر ( نه ) منطقی

// عملگرهای نوع داده ای در جاوااسکریپت

// توضیح         عملگرها 
//------------------------------------
//   typeof           نوع متغیر رو بر می گردونه
//  instanceof      
// برمی گردونه اگر یه شیء نمونه ای از یه نوع شیء باشه  true   